app/controllers/short_url_controller.rb

  def create
    puts params
    if params[:url].present?
      short_url = ShortUrl.new(
        url: params[:url],
        short_name: params[:short_name]
      )
      if short_url.save
---
INSERT INTO "short_urls" ("created_at", "short_name", "updated_at", "url") VALUES (?, ?, ?, ?)  [["created_at", Tue, 22 Jan 2013 16:40:08 UTC +00:00], ["short_name", nil], ["updated_at", Tue, 22 Jan 2013 16:40:08 UTC +00:00], ["url", "http://hat.com/"]]